{
  "title": "เรียนรู้การสร้างเว็บแอปพลิเคชันระดับมืออาชีพด้วย Go",
  "subject": "มีทุกสิ่งที่คุณจำเป็นต้องรู้เกี่ยวกับแนวทางปฏิบัติที่ดีที่สุด โครงสร้างโครงการ และรูปแบบโค้ดที่ใช้งานได้จริงโดยไม่ต้องอ่านรายละเอียดและคำอธิบายที่สำคัญ",
  "knowledge": [
    {
      "title": "All the fundamentals",
      "detail": "How to start a server, create handlers, send responses, route requests and serve static files."
    },
    {
      "title": "Structure and organization",
      "detail": "How to create an idiomatic and scalable structure for your web application."
    },
    {
      "title": "Using Modules — How to use Go's Module functionality to manage and version control your dependencies.",
      "detail": "Using Modules — How to use Go's Module functionality to manage and version control your dependencies."
    },
    {
      "title": "Managing configuration — How to use command-line flags and dependency injection to manage your application settings.",
      "detail": ""
    },
    {
      "title": "Logging and Error Handling — How to implement leveled logging and centralized error handling.",
      "detail": ""
    },
    {
      "title": "SQL databases — How to design a database model, set up a connection pool, and execute statements and queries.",
      "detail": ""
    },
    {
      "title": "HTML templating — How to cache your templates, display dynamic data, create custom functions and handle runtime errors.",
      "detail": ""
    },
    {
      "title": "Middleware — How to create your own middleware to perform common actions (like logging requests and recovering panics).",
      "detail": ""
    },
    {
      "title": "RESTful routing — How to create a modern request routing structure that follows the principles of REST.",
      "detail": ""
    },
    {
      "title": "Form validation — How to implement reusable and user-friendly pattern for validating forms and displaying errors.",
      "detail": ""
    },
    {
      "title": "Session management — How to use and configure sessions to persist data between requests.",
      "detail": ""
    },
    {
      "title": "Using HTTPS — How to correctly setup a HTTPS server and configure it for improved performance and security.",
      "detail": ""
    },
    {
      "title": "Prevent common vulnerabilities — How to prevent SQL injection, CSRF, XSS, clickjacking and slow-client attacks.",
      "detail": ""
    },
    {
      "title": "Authentication and authorization — How to safely encrypt user passwords and add signup, login and logout functionality.",
      "detail": ""
    },
    {
      "title": "Request context — How to use Go's context.Context to pass data between your middleware and handlers.",
      "detail": ""
    },
    {
      "title": "Testing — How to create unit tests, integration tests and end-to-end tests, mock dependencies and measure test coverage.",
      "detail": ""
    },
    {
      "title": "And most importantly… How to put it together in a fully-functioning application!",
      "detail": ""
    }
  ],
  "written": "Go 1.18",
  "updated": "July 13th, 2022",
  "Formats": "Go 1.18",
  "Language": "Thai",
  "version": "2.18.3",
  "fuarantee": "All purchases come with a 30-day money-back guarantee.",
  "pricing": [
    {
      "name": "PROFESSIONAL PACKAGE",
      "detail": "Complete application source code\nGuided exercises to check your understanding\nPrintable cribsheets for net/http & database/sql",
      "price": 3699
    },
    {
      "name": "BOOK Only",
      "detail": "book in HTML, PDF & EPUB format\nFuture updates and releases included",
      "price": 1299
    }
  ]
}